app/controllers/casas_controller.rb

SELECT "casas".* FROM "casas"
---
  def index
    @casas = Casa.all

SELECT  "casas".* FROM "casas"  WHERE "casas"."id" = ? LIMIT 1  [["id", "id"]]
---
  def show
    @casa = Casa.find(params[:id]) #where(id: params[:id]) #quiero traerme una casa con un id especifico

INSERT INTO "casas" ("created_at", "fundada_en", "nombre", "patrimonio", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-16 04:48:35.481125"], ["fundada_en", 2010], ["nombre", "Aloi"], ["patrimonio", 0], ["updated_at", "2014-11-16 04:48:35.481125"]]
---
  def create
    @casa = Casa.create(casas_params)

DELETE FROM "casas" WHERE "casas"."id" = ?  [["id", 11]]
---
  def destroy
    Casa.destroy(params[:id]) #anda, pero tira internal server error