app/controllers/fuerzas_controller.rb

SELECT "fuerzas".* FROM "fuerzas"  WHERE "fuerzas"."type" IN ('Aerea', 'Naval', 'Terrestre')  ORDER BY "fuerzas"."casa_id" ASC
---
  def index
    @fuerzas = []

    if(params.has_key? :casa)
      @fuerzas = Fuerza.where(type: ['Aerea','Naval','Terrestre'], casa_id: params[:casa])  #hizo un if feo para simplificar